In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [97]:
Sales   = pd.read_excel("Fountain9 DS Assignment Data.xlsx",sheet_name=0)
ProMast = pd.read_excel("Fountain9 DS Assignment Data.xlsx",sheet_name=1)
BranMast = pd.read_excel("Fountain9 DS Assignment Data.xlsx",sheet_name=2)
PO_1 = pd.read_excel("Fountain9 DS Assignment Data.xlsx",sheet_name=3)
Sup_Pro_Bran = pd.read_excel("Fountain9 DS Assignment Data.xlsx",sheet_name=4)
Select = pd.read_excel("Fountain9 DS Assignment Data.xlsx",sheet_name=5)

In [30]:
Sal  = pd.read_excel("Fountain9 DS Assignment Data.xlsx",sheet_name=None)
Sal['Product Master']

   Product ID            Product Name Category 1
0         1.0  Tropicana Orange Juice     Drinks
1         2.0                 Bourbon   Biscuits
2         2.0                 Bourbon   Biscuits

In [31]:
Sales

        Date  Product ID  Branch ID  Price  Quantity
0 2021-11-01         1.0      100.0   10.0     120.0
1 2021-11-01         2.0      200.0   15.0     450.0
2 2021-11-02         1.0      100.0   12.0     300.0
3 2021-11-02         2.0      200.0   20.0     500.0

In [32]:
ProMast.drop_duplicates()

   Product ID            Product Name Category 1
0         1.0  Tropicana Orange Juice     Drinks
1         2.0                 Bourbon   Biscuits

In [33]:
BranMast

   Branch ID Branch Name       City
0      100.0       Powai     Mumbai
1      200.0         HSR  Bangalore

In [34]:
PO_1

,Date,Purchase Order ID,Product ID,Branch ID,Supplier ID,Ordered Quantity,Received Quantity,Ordered Date,Received Date
0,2021-11-01,101.0,1.0,100.0,2000.0,100.0,NaN,2021-11-01,NaT
1,2021-11-01,102.0,1.0,100.0,2000.0,50.0,50.0,2021-10-25,2021-11-01
2,2021-11-01,103.0,1.0,100.0,2000.0,20.0,20.0,2021-10-28,2021-11-01
3,2021-11-01,104.0,2.0,200.0,3000.0,200.0,200.0,2021-11-01,2021-11-01
4,2021-11-01,105.0,2.0,200.0,3000.0,50.0,50.0,2021-10-27,2021-11-01
5,2021-11-01,106.0,2.0,200.0,3000.0,20.0,20.0,2021-10-29,2021-11-01

In [98]:
Sup_Pro_Bran

   Supplier ID  Product ID  Branch ID            Schedule Days
0       2000.0         1.0      100.0  ["Monday", "Wednesday"]
1       3000.0         1.0      200.0              ["tuesday"]
2       2000.0         2.0      100.0               ["Sunday"]
3       3000.0         2.0      200.0   ["Thursday", "monday"]

# 1. Perform operations on Sales, Product Master, Branch Master

In [9]:
Pro1 = ProMast.loc[:1,['Product Name','Category 1']]
Pro1

             Product Name Category 1
0  Tropicana Orange Juice     Drinks
1                 Bourbon   Biscuits

In [10]:

M = (pd.merge(Sales,ProMast.drop_duplicates(),how='left'))
pd.merge(M,BranMast,on = 'Branch ID',how='left')

,Date,Product ID,Branch ID,Price,Quantity,Product Name,Category 1,Branch Name,City
0,2021-11-01,1.0,100.0,10.0,120.0,Tropicana Orange Juice,Drinks,Powai,Mumbai
1,2021-11-01,2.0,200.0,15.0,450.0,Bourbon,Biscuits,HSR,Bangalore
2,2021-11-02,1.0,100.0,12.0,300.0,Tropicana Orange Juice,Drinks,Powai,Mumbai
3,2021-11-02,2.0,200.0,20.0,500.0,Bourbon,Biscuits,HSR,Bangalore

In [11]:
ProMast1 = Pro1.append(Pro1,ignore_index=True)
ProMast1

             Product Name Category 1
0  Tropicana Orange Juice     Drinks
1                 Bourbon   Biscuits
2  Tropicana Orange Juice     Drinks
3                 Bourbon   Biscuits

In [12]:
BranMast1 = BranMast[['Branch Name','City']].append(BranMast[['Branch Name','City']],ignore_index=True)
BranMast1

  Branch Name       City
0       Powai     Mumbai
1         HSR  Bangalore
2       Powai     Mumbai
3         HSR  Bangalore

In [13]:
# to add column use concat method and change axis =1 then add entries rowwise:
pd.concat([Sales,ProMast1,BranMast1],axis = 1)

,Date,Product ID,Branch ID,Price,Quantity,Product Name,Category 1,Branch Name,City
0,2021-11-01,1.0,100.0,10.0,120.0,Tropicana Orange Juice,Drinks,Powai,Mumbai
1,2021-11-01,2.0,200.0,15.0,450.0,Bourbon,Biscuits,HSR,Bangalore
2,2021-11-02,1.0,100.0,12.0,300.0,Tropicana Orange Juice,Drinks,Powai,Mumbai
3,2021-11-02,2.0,200.0,20.0,500.0,Bourbon,Biscuits,HSR,Bangalore

### SO, IN ABOVE DATAFRAME WE CAN SEE WE GET OUR DESIRED OUTPUT

# 2. Use Purchase Order 1 to calculate the following things
a. Add column 'lead time': Lead time is the difference between the ordered date and the received date in days

### a. ====>

In [14]:
PO_1

,Date,Purchase Order ID,Product ID,Branch ID,Supplier ID,Ordered Quantity,Received Quantity,Ordered Date,Received Date
0,2021-11-01,101.0,1.0,100.0,2000.0,100.0,NaN,2021-11-01,NaT
1,2021-11-01,102.0,1.0,100.0,2000.0,50.0,50.0,2021-10-25,2021-11-01
2,2021-11-01,103.0,1.0,100.0,2000.0,20.0,20.0,2021-10-28,2021-11-01
3,2021-11-01,104.0,2.0,200.0,3000.0,200.0,200.0,2021-11-01,2021-11-01
4,2021-11-01,105.0,2.0,200.0,3000.0,50.0,50.0,2021-10-27,2021-11-01
5,2021-11-01,106.0,2.0,200.0,3000.0,20.0,20.0,2021-10-29,2021-11-01

##### IN ABOVE CASE WE CAN SEE IN Received Date COLUMN 'NaT' IS PRESENT SO FIRST CHANGE IT.

In [15]:
Lead_Time = (pd.to_datetime(PO_1['Received Date']))-(pd.to_datetime(PO_1['Ordered Date']))
Lead_Time = pd.DataFrame(Lead_Time/np.timedelta64(1,'D'),columns = ['lead time'])

In [16]:
PO_2 = pd.concat([PO_1,Lead_Time],axis=1)
PO_2

,Date,Purchase Order ID,Product ID,Branch ID,Supplier ID,Ordered Quantity,Received Quantity,Ordered Date,Received Date,lead time
0,2021-11-01,101.0,1.0,100.0,2000.0,100.0,NaN,2021-11-01,NaT,NaN
1,2021-11-01,102.0,1.0,100.0,2000.0,50.0,50.0,2021-10-25,2021-11-01,7.0
2,2021-11-01,103.0,1.0,100.0,2000.0,20.0,20.0,2021-10-28,2021-11-01,4.0
3,2021-11-01,104.0,2.0,200.0,3000.0,200.0,200.0,2021-11-01,2021-11-01,0.0
4,2021-11-01,105.0,2.0,200.0,3000.0,50.0,50.0,2021-10-27,2021-11-01,5.0
5,2021-11-01,106.0,2.0,200.0,3000.0,20.0,20.0,2021-10-29,2021-11-01,3.0

##### so, here here we will get our desired output.

### b. ===>

### b. Calculate lead time average and lead time varience for each Product ID-Branch ID-Supplier ID combination

In [17]:
DPO = PO_2[['Product ID','Branch ID','Supplier ID']].drop_duplicates(ignore_index=True)
DPO

   Product ID  Branch ID  Supplier ID
0         1.0      100.0       2000.0
1         2.0      200.0       3000.0

In [18]:
PO_2.groupby('Product ID').get_group(DPO.iloc[0,0])['lead time'].agg(np.mean)

5.5

In [19]:
PO_2.groupby('Product ID').get_group(DPO.iloc[0,0])['lead time'].var()

4.5

In [20]:
PO_2.groupby(['Product ID','Branch ID','Supplier ID'])['lead time'].agg([np.mean,np.var])

                                      mean       var
Product ID Branch ID Supplier ID
1.0        100.0     2000.0       5.500000  4.500000
2.0        200.0     3000.0       2.666667  6.333333

# 3. Use Supplier-Product-Branch to convert the schedule Days column from text to numeric: use this for the mapping
    {'monday' : 0,'tuseday':1,'wednesday':2,'thursday':3,'friday':4,'saturday':5,'sunday':6}

In [91]:
Sup_Pro_Bran['Schedule Days']=Sup_Pro_Bran['Schedule Days'].str.strip('[]')

In [92]:
dict = {"monday" : 0,"tuseday":1,"wednesday":2,"thursday":3,"friday":4,"saturday":5,"sunday":6}

In [93]:
Sup_Pro_Bran['Schedule Days']=Sup_Pro_Bran['Schedule Days'].str.lower()

In [94]:
Sup_Pro_Bran['Schedule Days']=Sup_Pro_Bran['Schedule Days'].str.replace('monday','0')
Sup_Pro_Bran['Schedule Days']=Sup_Pro_Bran['Schedule Days'].str.replace('tuesday','1')
Sup_Pro_Bran['Schedule Days']=Sup_Pro_Bran['Schedule Days'].str.replace('wednesday','2')
Sup_Pro_Bran['Schedule Days']=Sup_Pro_Bran['Schedule Days'].str.replace('thursday','3')
Sup_Pro_Bran['Schedule Days']=Sup_Pro_Bran['Schedule Days'].str.replace('friday','4')
Sup_Pro_Bran['Schedule Days']=Sup_Pro_Bran['Schedule Days'].str.replace('saturday','5')
Sup_Pro_Bran['Schedule Days']=Sup_Pro_Bran['Schedule Days'].str.replace('sunday','6')

In [110]:
a=['Monday', 'tuesday', 'Sunday','Thursday', 'monday']
pd.Series(a)

0      Monday
1     tuesday
2      Sunday
3    Thursday
4      monday
dtype: object

In [82]:
dict

{'monday': 0,
 'tuseday': 1,
 'wednesday': 2,
 'thursday': 3,
 'friday': 4,
 'saturday': 5,
 'sunday': 6}

# 4. use select sheet and add a new column 'Result' to it

### a. for all rows where the category is biscuits populate the 'result' column with the value of qauntity column

### b. for all other columns, populate the result column with the value of price column

In [ ]:
Select['Result']=Select.groupby('Product Category').get_group('Biscuits').Quantity 

Select['Result']

In [ ]:
Select['Result']=Select['Result'].fillna(Select[ Select['Product Category'] != 'Biscuits'].Price)
Select['Result']

In [ ]:
Select